from transformers import AutoTokenizer

tokenizer = AutoTokenizer.from_pretrained("l3cube-pune/telugu-sentence-bert-nli")

sentences = [
      ' హై ఫ్రెండ్స్ మహారాష్ట్రలోని హరిచంద్ర కోటలో ఒక శివాలయం ఉంది ఈ శివాలయంలో ఉన్న ఒక స్తంభం కూల్పోతే కలియొగ మొత్తం అంటే ఇప్పుడు భూమ్మీద ఉన్న ప్రతి ఒకటి అంతమైపోతుందని చెబుతూ ంటారు .'
'ఈ గుడిలో ఉన్న శివలింగం చుట్టూ నాలుగు స్తంభాలుంటాయి ఇవి నాలుగు యుగాలకు ప్రత్యేకగా చెప్పుకుంటారు .'
'ఆల్రడీ కాలక్రమైన మూడు యుగాలు గడిచిపోయా కాబట్టి మూడు స్తంభాలు కూల్పోయాయి సో ఇంకా మిగిలి ఉన్నది, కలియుగ మాత్రమే దీనికి స్తంభం మూలంగా చెప్పుకుంటారు.'
'ఇది కనుక కూలిపోతే ప్రణయం వచ్చి మన భూమి మొత్తం నాశనమైపోతుందని నమ్ముతున్నారు .'
'ఇక్కడ మనన్ని ఆశ్చర్యపరిచే ఇంకో విషయం ఏంటంటే ఆ ఒక్క స్తమంపైనే ఆ గుడిపోయన మన్న కొన్ని వందల టన్నుల బరువుకళ రాయి ఆధారపడి ఉంది.'
'ఇది ఎలా సాధ్యమని ఇప్పటికీ ఏ శాస్త్రవేత్తలు కొనుక్కోలేకపోయారు ,ఇది ఒక మిస్టరీగానే మిగిలిపోయింది.'

]

for sentence in sentences:
    tokens = tokenizer.tokenize(sentence)
    print(f"Original Sentence: {sentence}")
    print(f"Tokens: {tokens}")
    print()
